app/controllers/notes_controller.rb

SELECT * FROM `notes` WHERE (plain_content LIKE '%' AND title LIKE 'note%') ORDER BY created_at DESC
SELECT count(*) AS count_all FROM `notes`
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_type = 'Note') AND (`taggings`.taggable_id = 1))
---
  def index
    if(params[:tag].nil? || params[:tag].empty?)
      @notes = Note.all(:conditions => "title LIKE '%#{params[:query]}%' OR plain_content LIKE '%#{params[:query]}%'", :order => "created_at DESC").paginate :page => params[:page_number], :per_page => 10
    else
      @notes = Note.find_tagged_with(params[:tag], :order => "created_at DESC").paginate :page => params[:page_number], :per_page => 10

SELECT count(*) AS count_all FROM `notes` WHERE (plain_content LIKE 'amit%' AND title LIKE '%')
---
  def total_count
    if(params[:tag].nil? || params[:tag].empty?)
      @count = Note.count(:conditions => "title LIKE '%#{params[:query]}%' OR plain_content LIKE '%#{params[:query]}%'")

SELECT * FROM `notes` WHERE (`notes`.`id` = 1)
---
  def show
    @note = Note.find(params[:id])

SELECT * FROM `notes` WHERE (`notes`.`id` = 1)
---
  def edit
    @note = Note.find(params[:id])

INSERT INTO `notes` (`updated_at`, `title`, `content`, `created_at`) VALUES('2010-02-11 16:51:09', 'Test note', '<TEXTFORMAT LEADING=\"2\"><P ALIGN=\"CENTER\"><FONT FACE=\"Verdana\" SIZE=\"10\" COLOR=\"#0B333C\" LETTERSPACING=\"0\" KERNING=\"0\">testing <FONT COLOR=\"#CC3333\">fdafds <FONT SIZE=\"12\">sdfsadf <U>asdfsdf sdf</U></FONT></FONT></FONT></P></TEXTFORMAT>', '2010-02-11 16:51:09')
---
  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save

SELECT * FROM `notes` WHERE (`notes`.`id` = 1)
UPDATE `notes` SET `content` = '<TEXTFORMAT LEADING=\"2\"><P ALIGN=\"LEFT\"><FONT FACE=\"Verdana\" SIZE=\"11\" COLOR=\"#FFFFFF\" LETTERSPACING=\"0\" KERNING=\"0\">new note testing nicely</FONT></P></TEXTFORMAT>', `plain_content` = 'new note testing nicely', `updated_at` = '2010-02-14 09:43:06' WHERE `id` = 1
---
  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])